{
  "nodes": [
    {
      "op": "null", 
      "name": "RIDAGEYR", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "RIDAGEYR_fullyconnected0_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "RIDAGEYR_fullyconnected0_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "RIDAGEYR_fullyconnected0", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "RIDAGEYR_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DMQMILIT", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DMQMILIT_embedding0_weight", 
      "attrs": {
        "input_dim": "100", 
        "output_dim": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "DMQMILIT_embedding0", 
      "attrs": {
        "input_dim": "100", 
        "output_dim": "10"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DMQMILIT_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DMQMILIT_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "DMQMILIT_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat10", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[4, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_MCQ220_weight", 
      "attrs": {"num_hidden": "3"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_MCQ220_bias", 
      "attrs": {"num_hidden": "3"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_MCQ220", 
      "attrs": {"num_hidden": "3"}, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "log_softmax", 
      "name": "log_softmax1", 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "MCQ220", 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attrs": {"scalar": "0.0"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar12", 
      "attrs": {"scalar": "3"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1", 
      "inputs": [[16, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[16, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split1", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "pick", 
      "name": "pick2", 
      "inputs": [[15, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3", 
      "attrs": {"scalar": "-1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like1", 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "broadcast_greater", 
      "name": "broadcast_greater1", 
      "inputs": [[21, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul4", 
      "inputs": [[23, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "__empirical_risk_instance_weight__", 
      "inputs": []
    }, 
    {
      "op": "pick", 
      "name": "pick3", 
      "inputs": [[27, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul5", 
      "inputs": [[26, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum11", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar13", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div11", 
      "inputs": [[29, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1", 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum12", 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul11", 
      "inputs": [[32, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean10", 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar14", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div12", 
      "inputs": [[35, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum21", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar21", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum20", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar20", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul12", 
      "inputs": [[40, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss10", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax1", 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-MCQ220", 
      "inputs": [[45, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    8, 
    9, 
    12, 
    13, 
    16, 
    27
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47
  ], 
  "heads": [[44, 0, 0], [46, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10401]}
}